cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'spotify/public'

brew 'ag'
brew "ansible"
brew "ansible-lint"
brew 'awscli'
brew 'bash'
brew 'boot-clj'
brew 'diff-so-fancy'
brew 'coreutils'
brew "doitlive"
brew 'elm'
brew 'exa'
brew 'fasd'
brew 'findutils'
brew 'gnu-sed', args: ['default-names']
brew 'go'
brew 'grc'
brew 'grep'
brew 'gnupg'
brew 'gpg-agent'
brew "heroku"
brew 'httpstat'
brew "httpie"
brew 'hub'
brew 'imagemagick', args: ['with-webp']
brew 'python'
brew 'jenv'
brew 'jq'
brew 'jp2a'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'libgit2'
brew 'leiningen'
# brew 'maven'
brew 'moreutils'
brew 'node'
brew 'openssl'
brew "pgcli"
brew 'pinentry-mac'
brew 'pyenv'
brew 'reattach-to-user-namespace' # https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard
brew 'readline'
brew 'roundup'
brew 'stunnel'
brew 'shellcheck'
brew 'tree'
brew 'tmux'
brew 'unrar'
brew 'vim', args: ['override-system-vi']
brew 'wget', args: ['with-iri']
brew 'yarn'
brew 'zopfli'
brew 'zsh'


# Just for fun
brew 'cowsay'
brew 'fortune'

cask '1password'
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'fiddler'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'gyazo'
cask 'handbrake'
cask 'hyperdock'
cask 'iterm2'
cask 'java'
cask 'licecap'
cask 'limechat'
cask 'minikube'
cask 'mysqlworkbench'
cask 'noti'
cask 'private-internet-access'
cask 'rescuetime'
cask 'safari-technology-preview'
cask 'screenhero'
cask 'slack'
cask 'steam'
cask 'sublime-text'
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
