cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

brew 'bash'
brew 'diff-so-fancy'
brew 'coreutils'
brew 'fasd'
brew 'findutils'
brew 'gnu-sed', args: ['default-names']
brew 'go'
brew 'grc'
brew 'grep'
brew 'hub'
brew 'imagemagick', args: ['with-webp']
brew 'jp2a'
brew 'libgit2'
brew 'moreutils'
brew 'node'
brew 'openssh'
brew 'openssl'
brew 'readline'
brew 'roundup'
brew 'tmux'
brew 'unrar'
brew 'vim', args: ['override-system-vi']
brew 'wget', args: ['with-iri']
brew 'zopfli'
brew 'zsh'

# Just for fun
brew 'cowsay'
brew 'fortune'

cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'gyazo'
cask 'handbrake'
cask 'hyperdock'
cask 'iterm2'
cask 'licecap'
cask 'limechat'
cask 'rescuetime'
cask 'screenhero'
cask 'seashore'
cask 'slack'
cask 'steam'
cask 'sublime-text3'
cask 'tunnelbear'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
